test/fixtures/quaderno_cassettes/unpay_an_expense.yml

---
http_interactions:
- request:
    method: get
    uri: http://sk_test_B7xXrTspfeGukQqGN1pK@development.lvh.me:3000/api/expenses.json?
    body:
      encoding: US-ASCII
      string: ''
    headers:
      accept:
      - application/json
      authorization:
      - Basic c2tfdGVzdF9CN3hYclRzcGZlR3VrUXFHTjFwSzo=
  response:
    status:
      code: 200
      message: OK
    headers:
      x-frame-options:
      - ALLOWALL
      x-ratelimit-limit:
      - '2000'
      x-ratelimit-reset:
      - '15'
      x-ratelimit-remaining:
      - '99'
      x-pages-currentpage:
      - '1'
      x-pages-totalpages:
      - '1'
      content-type:
      - application/json; charset=utf-8
      etag:
      - '"f1c6b75cdd65aed7489f119573a47592"'
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - d9056371-f011-476f-a9cd-2142555c49e9
      x-runtime:
      - '4.767592'
      connection:
      - close
      server:
      - thin
    body:
      encoding: UTF-8
      string: '[{"id":191,"blocked":false,"issue_date":"2017-06-12","created_at":1497267534,"contact":{"id":44,"full_name":"Albus
        Dumbledoge"},"country":"BE","street_line_1":null,"street_line_2":null,"city":null,"region":null,"postal_code":null,"po_number":null,"currency":"EUR","subject":null,"items":[{"id":192,"description":"Aircraft","quantity":"1.0","unit_price_cents":"0.0","discount_rate":"0.0","tax_1_name":null,"tax_1_rate":null,"tax_2_name":null,"tax_2_rate":null,"reference":null,"subtotal_cents":"0.0","discount_cents":"0.0","gross_amount_cents":"0.0"}],"subtotal_cents":"0.0","discount_cents":"0.0","taxes":[],"extract":{"total_cents":0},"payments":[],"notes":null,"state":"outstanding","tag_list":[],"url":"http://development.lvh.me:3000/api/expenses/191.json","custom_metadata":{}},{"id":184,"blocked":false,"issue_date":"2017-06-12","created_at":1497266330,"contact":{"id":44,"full_name":"Albus
        Dumbledoge"},"country":"BE","street_line_1":null,"street_line_2":null,"city":null,"region":null,"postal_code":null,"po_number":null,"currency":"EUR","subject":null,"items":[{"id":185,"description":"Aircraft","quantity":"1.0","unit_price_cents":"0.0","discount_rate":"0.0","tax_1_name":null,"tax_1_rate":null,"tax_2_name":null,"tax_2_rate":null,"reference":null,"subtotal_cents":"0.0","discount_cents":"0.0","gross_amount_cents":"0.0"}],"subtotal_cents":"0.0","discount_cents":"0.0","taxes":[],"extract":{"total_cents":0},"payments":[{"id":40,"date":"2017-06-12","payment_method":"cash","amount_cents":1000000,"url":"http://development.lvh.me:3000/api/expenses/184/payments/40.json"},{"id":41,"date":"2017-06-12","payment_method":"cash","amount_cents":1000000,"url":"http://development.lvh.me:3000/api/expenses/184/payments/41.json"},{"id":42,"date":"2017-06-12","payment_method":"cash","amount_cents":1000000,"url":"http://development.lvh.me:3000/api/expenses/184/payments/42.json"},{"id":43,"date":"2017-06-12","payment_method":"cash","amount_cents":1000000,"url":"http://development.lvh.me:3000/api/expenses/184/payments/43.json"}],"notes":null,"state":"paid","tag_list":[],"url":"http://development.lvh.me:3000/api/expenses/184.json","custom_metadata":{}},{"id":137,"blocked":true,"issue_date":"2017-05-29","created_at":1496060112,"contact":{"id":42,"full_name":"Cidi
        Campidocti"},"country":"ES","street_line_1":null,"street_line_2":null,"city":null,"region":null,"postal_code":null,"po_number":null,"currency":"EUR","subject":null,"items":[{"id":138,"description":"asdasd","quantity":"1.0","unit_price_cents":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":null,"tax_2_name":"","tax_2_rate":null,"reference":"","subtotal_cents":"0.0","discount_cents":"0.0","gross_amount_cents":"0.0"}],"subtotal_cents":"0.0","discount_cents":"0.0","taxes":[],"extract":{"total_cents":0},"payments":[],"notes":null,"state":"paid","tag_list":["dundundugan","rap"],"url":"http://development.lvh.me:3000/api/expenses/137.json","custom_metadata":{}},{"id":135,"blocked":false,"issue_date":"2017-05-26","created_at":1495789529,"contact":{"id":42,"full_name":"Cidi
        Campidocti"},"country":"ES","street_line_1":null,"street_line_2":null,"city":null,"region":null,"postal_code":null,"po_number":null,"currency":"EUR","subject":null,"items":[{"id":136,"description":"Dreamhack
        valencia","quantity":"1.0","unit_price_cents":"23000.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":null,"tax_2_name":"","tax_2_rate":null,"reference":"","subtotal_cents":"23000.0","discount_cents":"0.0","gross_amount_cents":"23000.0"}],"subtotal_cents":"23000.0","discount_cents":"0.0","taxes":[],"extract":{"total_cents":23000},"payments":[{"id":7,"date":"2017-05-31","payment_method":"credit_card","amount_cents":23000,"url":"http://development.lvh.me:3000/api/expenses/135/payments/7.json"}],"notes":null,"state":"paid","tag_list":["balls"],"url":"http://development.lvh.me:3000/api/expenses/135.json","custom_metadata":{}},{"id":134,"blocked":false,"issue_date":"2017-05-26","created_at":1495789490,"contact":{"id":42,"full_name":"Cidi
        Campidocti"},"country":"ES","street_line_1":null,"street_line_2":null,"city":null,"region":null,"postal_code":null,"po_number":null,"currency":"EUR","subject":null,"items":[{"id":135,"description":"Something","quantity":"1.0","unit_price_cents":"1000.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":null,"tax_2_name":"","tax_2_rate":null,"reference":"","subtotal_cents":"1000.0","discount_cents":"0.0","gross_amount_cents":"1000.0"}],"subtotal_cents":"1000.0","discount_cents":"0.0","taxes":[],"extract":{"total_cents":1000},"payments":[{"id":4,"date":"2017-05-31","payment_method":"credit_card","amount_cents":1000,"url":"http://development.lvh.me:3000/api/expenses/134/payments/4.json"}],"notes":null,"state":"paid","tag_list":["rap","god"],"url":"http://development.lvh.me:3000/api/expenses/134.json","custom_metadata":{}}]'
    http_version: '1.1'
  recorded_at: Mon, 12 Jun 2017 11:40:45 GMT
- request:
    method: post
    uri: http://sk_test_B7xXrTspfeGukQqGN1pK@development.lvh.me:3000/api/expenses/191/payments.json
    body:
      encoding: UTF-8
      string: payment_method=cash&amount=10000
    headers:
      accept:
      - application/json
      authorization:
      - Basic c2tfdGVzdF9CN3hYclRzcGZlR3VrUXFHTjFwSzo=
  response:
    status:
      code: 201
      message: Created
    headers:
      x-frame-options:
      - ALLOWALL
      x-ratelimit-limit:
      - '2000'
      x-ratelimit-reset:
      - '11'
      x-ratelimit-remaining:
      - '98'
      content-type:
      - application/json; charset=utf-8
      etag:
      - '"e128a5cd88d56beafeb08fa7dc3e0f0c"'
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - 975589c8-f973-47a7-ba33-47904846cdf3
      x-runtime:
      - '1.601460'
      connection:
      - close
      server:
      - thin
    body:
      encoding: UTF-8
      string: '{"id":44,"date":"2017-06-12","payment_method":"cash","amount_cents":1000000,"url":"http://development.lvh.me:3000/api/expenses/191/payments/44.json"}'
    http_version: '1.1'
  recorded_at: Mon, 12 Jun 2017 11:40:47 GMT
- request:
    method: delete
    uri: http://sk_test_B7xXrTspfeGukQqGN1pK@development.lvh.me:3000/api/expenses/191/payments/44.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      accept:
      - application/json
      authorization:
      - Basic c2tfdGVzdF9CN3hYclRzcGZlR3VrUXFHTjFwSzo=
  response:
    status:
      code: 204
      message: No Content
    headers:
      x-frame-options:
      - ALLOWALL
      x-ratelimit-limit:
      - '2000'
      x-ratelimit-reset:
      - '9'
      x-ratelimit-remaining:
      - '97'
      cache-control:
      - no-cache
      x-request-id:
      - 15fca226-5468-4fe3-9834-da3078e59105
      x-runtime:
      - '1.416175'
      connection:
      - close
      server:
      - thin
    body:
      encoding: US-ASCII
      string: ''
    http_version: '1.1'
  recorded_at: Mon, 12 Jun 2017 11:40:48 GMT
recorded_with: VCR 2.9.2
